#### SetSpecificFittingAngleStatus Method

---

|  |
| --- |
| PipeSettings Class   See Also |

Sets the status of given specific angle.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void SetSpecificFittingAngleStatus( 	double angle, 	bool bStatus ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetSpecificFittingAngleStatus ( _ 	angle As Double, _ 	bStatus As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetSpecificFittingAngleStatus( 	double angle,  	bool bStatus ) ``` |

#### Parameters

angle
:   Type:  System Double
     The specific angle (in degree) that must be one of 60, 45, 30, 22.5 or 11.25 degrees.

bStatus
:   Type:  System Boolean
     Status, true - using the given angle during the pipe layout.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The given value for angle must be 90, 60, 45, 30, 22.5 or 11.25 degrees. |
| Autodesk.Revit.Exceptions InvalidOperationException | Can not set an angle status for an invalid angle. |

# See Also

PipeSettings Class

Autodesk.Revit.DB.Plumbing Namespace